<template>
    <div>
    <h2 class="mmm"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" fill="currentColor" viewBox="0 0 16 16">
			<path d="M8 8a3 3 0 1 0 0-6 3 3 0 0 0 0 6zm2-3a2 2 0 1 1-4 0 2 2 0 0 1 4 0zm4 8c0 1-1 1-1 1H3s-1 0-1-1 1-4 6-4 6 3 6 4zm-1-.004c-.001-.246-.154-.986-.832-1.664C11.516 10.68 10.289 10 8 10c-2.29 0-3.516.68-4.168 1.332-.678.678-.83 1.418-.832 1.664h10z"/>	</svg>  MBTI 测试器</h2>
    <p  class="mmm">
        注意事项: 1.请在心态平和及时间充足的情况下才开始答题。<br>
        2.每道题目均有两个答案:A和B。请仔细阅读题目,按照与你性格相符的程度选择。 <br>
        3.请注意,题目的答案无对错之分,你不需要考虑哪个答案“应该”更好,而且不要在任何问题上思考太久,而是应该凭你心里的第一反应做出选择。 <br>
        4.如果你觉得在不同的情境里,两个答案或许都能反映你的倾向,请选择一个对于你的行为方式来说最自然、最顺畅和最从容的答案。<br>
        5.空题将视作中立,过多中立答案会影响结果
    </p>
    <el-button class="mmm" @click="ff3" text bg>极速版(12题，不大准确)</el-button>
    <el-button class="mmm" @click="ff2" text bg>简易版(48题，还算准确)</el-button>
    <el-button class="mmm" @click="ff1" text bg>完整版(93题，较为准确)</el-button><br>
        <div v-for="(item,index) in res">
    <p style="margin-left: 5px;font-weight: bold;" >{{index+1}}.{{ item.q }}</p>
    <el-row :gutter="15" >
    <el-col :span="5" style="margin-left:15px"><p class="pp" >{{ item.a }}</p></el-col>
    <el-col :span="10" style="margin-left:20px;margin-right:5px"><el-radio-group v-model="item.r"  style="min-width:175px">
    <el-radio-button size="small" value="5">2</el-radio-button>
    <el-radio-button size="small" value="4">1</el-radio-button>
    <el-radio-button size="small" value="3">0</el-radio-button>
    <el-radio-button size="small" value="2">1</el-radio-button>
    <el-radio-button size="small" value="1">2</el-radio-button>
</el-radio-group></el-col>
<el-col :span="5" style="margin-right:15px"> <p class="pp" >{{ item.b }}</p></el-col>
</el-row><br><br>
    </div>
    </div>
    <el-button class="mmm" @click="ff" text bg>提交</el-button>
    <el-card style="max-width: 100%;margin: 20px;" :class="display">
    <template #header>
        <h2>{{name}}</h2>
    </template>
         <el-image style="width: 100%;margin-top:30px;margin-bottom:30px" :src="img" :fit="full" />
    <div v-html="text"></div>
  </el-card>
  <div>
  <h3 style="text-align: center;">网站浏览次数</h3><br>
  <div style="text-align: center; width:100%;height:100%; display: table;">
   <span style="display: table-cell; vertical-align: middle; ">
    <img style="margin:0 auto" src="https://api.vore.top/api/ACGcount?code=toolstack">
   </span>
</div>
 </div>

</template>
<script setup>
import data1 from '/public/data/mbti1.json'
import data2 from '/public/data/mbti2.json'
import data3 from '/public/data/mbti3.json'
import { ref } from 'vue'
const display=ref('off')
const name=ref("")
const img=ref("")
const text=ref("<p></p>")
const res=ref([{"q":"请先选择", "a":"", "b":"", "r":""}])
function ff1(){
    data1.sort(function(){
      return Math.random()-0.5
  })
    res.value=data1
}
function ff3(){
    data3.sort(function(){
      return Math.random()-0.5
  })
    res.value=data3
}

function ff2(){
    data2.sort(function(){
      return Math.random()-0.5
  })
    res.value=data2
}

function ff(){
    let e=0,i=0,s=0,n=0,t=0,f=0,j=0,p=0,k=0,result1,result2,result3,result4;
   const a=res.value
    a.map(function ree(item){
        console.log(item.aa)
        console.log(item.r,parseInt(item.r))
    switch(item.aa){
        case "E": 
                if(parseInt(item.r)>3){
                    e+=parseInt(parseInt(item.r))-3
                }else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    i+=3-parseInt(item.r)
                    
                }
                break;
        case "I": 
                if(parseInt(item.r)>3){
                    i+=parseInt(item.r)-3
                }
                else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    e+=3-parseInt(item.r)
                };
                break;
        case "S": 
                if(parseInt(item.r)>3){
                    s+=parseInt(item.r)-3
                }
                else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    n+=3-parseInt(item.r)
                };               
                break;
        case "N":
                if(parseInt(item.r)>3){
                    n+=parseInt(item.r)-3
                }else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    s+=3-parseInt(item.r)
                };
                break;
        case "T":
        if(parseInt(item.r)>3){
                    t+=parseInt(item.r)-3
                    console.log(t)
                }
                else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    f+=3-parseInt(item.r)
                };
                break;
        case "F": 
        if(parseInt(item.r)>3){
                    f+=parseInt(item.r)-3
                }
                else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    t+=3-parseInt(item.r)
                };        
        break;
        case "J": 
        if(parseInt(item.r)>3){
                    j+=parseInt(item.r)-3
                }else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    p+=3-parseInt(item.r)
                };
        break;
        case "P":
        if(parseInt(item.r)>3){
                    p+=parseInt(item.r)-3
                    console.log(p)
                }else if(parseInt(item.r)==3 || parseInt(item.r)==0){}
                else{
                    j+=3-parseInt(item.r)
                };    
        break;
    }
   })
   console.log("e,i,s,n,t,f,j,p",e,i,s,n,t,f,j,p)
   
   if(e>=i){
    result1="E"
   }else{
    result1="I"
   }
   if(s>=n){
    result2="S"
   }else{
    result2="N"
   }
   if(t>=f){
    result3="T"
   }else{
    result3="F"
   }
   if(j>=p){
    result4="J"
   }else{
    result4="P"
   }
  
   console.log(result1,result2,result3,result4)
   let result=result1+result2+result3+result4
    console.log(result)
   switch(result){
    case "INTP":
        name.value="INTP 逻辑学家";
        text.value= `
        <div class="description__content">
<p>逻辑学家以其独特的视角和旺盛的智力而自豪。他们不禁对宇宙的奥秘感到困惑--这也许可以解释为什么有史以来一些最有影响力的哲学家和科学家都是逻辑学家。这种人格类型相当罕见，但凭借他们的创造力和发明，逻辑学家并不惧怕在人群中脱颖而出。</p>
<h2>心灵的生活</h2>
<p>逻辑学家经常陷入沉思--这不一定是一件坏事。这种性格类型的人几乎不会停止思考。从他们醒来的那一刻起，他们的脑海里就充满了想法、问题和洞察。有时，他们甚至会发现自己在自己的头脑中进行全方位的辩论。</p>
<div class="description-pullout">富有想象力和好奇心的逻辑学家可以在自己的思想运作中找到无尽的魅力。</div>
<p>站在局外看，逻辑学家似乎生活在永无止境的白日梦中。他们以沉思、超然和有点内向而为人所知。也就是说，除非他们试图把他们所有的精神能量转移到当前或身边的人，否则可能会让所有人感到不太舒服。但是，无论他们处于哪种模式，逻辑学家都是内向的，并且倾向于因广泛的社交而感到疲倦。漫长的一天后，他们渴望有时间独自征询自己的想法。</p>
<p>但是认为逻辑学家不友好或拘谨是错误的。当他们与一个能与他们的精神能量相匹配的人联系时，这些人格绝对会发光，从一个想法跳到另一个想法。很少有事情像有机会交换想法或与另一个好奇的、爱追根究底的灵魂进行热烈的辩论一样使他们充满活力。</p>
<h2>一切的基础，我敬爱的逻辑学家</h2>
<p>逻辑学家喜欢分析模式。不一定知道他们是如何做到的，但这种性格类型的人通常会有夏洛克·福尔摩斯式的发现差异和非常规行为的诀窍。换句话说，对他们撒谎并不明智。</p>
<p>具有讽刺意味的是，逻辑学家的话不应该总是从字面上理解。他们很少故意不诚实，但是由于他们的思想活跃，他们有时会充斥着他们一直没有充分思考过的想法和理论。他们可能会改变主意，从周末计划到基本的道德原则，而从未意识到一开始自己似乎已经下定了决心。此外，他们通常很乐意扮演他们实际上反对的观点的拥护者，以保持讨论的趣味性。</p>
<div class="description-pullout">对于逻辑学家来说，最好的对话就像头脑风暴会议，有足够的空间容纳非常规的想法和假设。</div>
<p>逻辑学家可以整天思考想法和可能性--他们经常这样做。虽说如此，但将这些想法变为现实的实际日常工作并不总是会引起他们的兴趣。幸运的是，在剖析棘手的多层问题并提出创造性的解决方案时，很少有人格类型能够与逻辑师的创造才能和潜力相提并论。</p>
<h2>宇宙的奥秘</h2>
<p>具有这种个性类型的人希望了解宇宙中的一切，但有一个领域特别容易让他们感到困惑：人性。但逻辑学家在逻辑和理性领域最有宾至如归的感觉。结果，他们会发现自己对情感和情绪影响人们行为 (包括他们自己的行为) 的不合逻辑，不合理的方式感到困惑。</p>
<p>这并不意味着逻辑学家没有感觉。这些人通常希望为他们的朋友和亲人提供情感支持，但他们不一定知道如何做。而且由于他们无法决定提供支持的最佳、最有效的方式，因此他们可能会推迟做任何事情或说任何话。</p>
<p>这种 “分析瘫痪” 会影响逻辑师生活的多个领域。这种性格类型的人即使是最小的决定也会过度思考。这会让他们感到效率低下，陷入困境，因为脑海中没完没了的想法让他们筋疲力尽，以至于难以完成任务。</p>
<p>好消息是，逻辑学家不必长期陷入困境。他们的独特优势包括把他们从偶尔陷入的困境中解脱出来所需的一切。通过利用他们的创造力和开放的思想，逻辑学家可以发挥他们的全部潜力--既是思想家又是快乐、全面的人。</p></div>
   <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/intp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/logician.svg"
        break;
    case "ESTJ":
        name.value="ESTJ 总经理";
        text.value= `<p>总经理人格类型的人是传统和秩序的代表，利用他们对正确，错误和社会标准的理解来团结家庭和社区。他们诚实，爱奉献，有尊严，他们的明确建议和指导被人看重，也愿意披荆斩棘，带领大家努力前行。他们会因为团结大家而骄傲，常常承担起社区组织者的角色，努力组织大家一起庆祝当地重要的节日，或守护着那些使家庭和社区紧密相连的传统价值观。</p><h3>以身作则</h3>
                    <p>在民主社会中，对这种领导的需求很高，并且他们构成了不少于11% 的人口，难怪许多总统都是总经理类型。法治的坚定信徒，认为权威必须有获得大众认可的业绩，总经理以身作则，表现出奉献精神和充满决心的坦诚，并完全拒绝懒惰和作弊，尤其是在工作中。如果有人宣称辛勤的人力工作是建立品行的绝佳方法，这个人就是总经理。</p>
<p>总经理清晰地感知到他们周围的环境，并生活在一个清晰、可核实事实的世界里--他们对知识的把握意味着，即使面对强大的抵抗，他们也会坚持自己的原则，推动一种明确的愿景，即什么是可以接受的，什么是不可以接受的。他们的观点也不只是空谈，因为总经理们非常愿意深入到最具挑战性的项目中，改进行动计划，并在此过程中对细节进行分类，即使最复杂的任务也显得轻松而易于完成。</p>
<p>然而，总经理们不会独自工作，他们期望自己的可靠性和职业道德得到回馈--这种性格类型的人实现了他们的承诺，如果合伙人或下属因无能或懒惰，或者更糟糕的是不诚实而危及他们，他们会毫不犹豫地表现出愤怒。这可能为他们赢得不够灵活的声誉，这是所有守护者都拥有的特质，但这并不是因为总经理任意这般固执，而是因为他们真正相信这些价值观能维持社会正常运转。</p>
<h3>更大的责任</h3>
        <p>总经理面临的主要挑战是要认识到，并不是每个人都遵循相同的路线或以相同的方式做出贡献。真正的领导者认识到个人以及团队的力量，并帮助将这些人的想法引入实施层面上。这样，总经理就确实掌握了所有的事实，并且能够把每个人引向有效的方向。</p><br><br> <a class="ambti"  href="https://www.16personalities.com/ch/estj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/images/personality-types/scenes/sentinels_Executive_ESTJ_introduction.svg"
        break;
    case "INTJ":
        name.value="INTJ 建筑师";
        text.value= `
        <div class="description__content">
<p>高处不胜寒。作为最稀有的人格类型之一--也是最有能力的人群之一--建筑师 (INTJ) 非常了解这一点。理性而机智的建筑师以自己的思考能力为傲，更不用说他们看穿虚伪和做作的神奇本领了。但由于他们的头脑永远不会休息，建筑师可能很难找到能够跟上他们对周围一切不间断分析的人。</p>
<div class="scene">
</div>
<h2>开拓精神</h2>
<p>建筑师质疑一切。许多人格类型信任现状，依靠传统智慧和他人的专业知识来指导他们的生活。但是持怀疑态度的建筑师更喜欢自己去发现。为了寻求更好的做事方式，他们不怕违反规则或冒不赞成的风险--实际上，他们反而乐在其中。</p>
<p>但是，正如任何具有这种个性类型的人都会告诉您的那样，除非真正有效，否则新想法毫无价值。建筑师希望成功，而不仅仅是推陈出新。他们全心全意地投入到他们的工作中，运用他们的洞察力、逻辑和意志力的全部能量。有些人会通过执行毫无意义的规则或粗制滥造的批评试图放慢他们的脚步，而上天似乎也在推波助澜。</p>
<div>建筑师，从内心深处与独立牢牢绑定，想要摆脱别人的期望，追求自己的想法。</div>
<p>这种人格类型带有强烈的独立倾向。建筑师不介意独自行动，也许是因为他们不喜欢坐等需要赶上他们的人。他们通常也更喜欢在不征求任何人意见的情况下做出决定。有时，这种独狼行为可能会显得麻木不仁，因为它没有考虑到其他人的想法、欲望和计划。</p>
<p>但是，将建筑师视为漠不关心是错误的。无论对他们泰然处之的智力层面有什么刻板印象，这些个性类型也都有深厚的感性认知。当事情出错或伤害他人时，建筑师会感同身受，并花费大量时间和精力试图弄清楚为什么事情会以这种方式发生。他们可能并不总是将情感视为决策工具，但他们是真真切切的人。</p>
<h2>对知识的渴望</h2>
<p>建筑师既可以是最大胆的梦想家，也可以是最悲观的人。他们相信，通过意志力和智慧，他们甚至可以实现最具挑战性的目标。但是，这些人格可能更普遍地对人性持愤世嫉俗的态度，假设大多数人是懒惰的，缺乏想象力的，或者注定要平庸。</p>
<p>具有建筑师个性类型的人的自尊心很大程度上来自他们的知识和精神敏锐度。在学校里，他们可能被称为 “书虫” 或 “书呆子”。但是，许多建筑师并没有把这些标签当作侮辱，而是欣然接受了它们。他们认识到自己有能力自学并掌握自己感兴趣的任何主题，无论是编码、卡波耶拉还是古典音乐都是如此。</p>
<div>建筑师不只是为了炫耀而学习新事物--他们从内心喜欢扩大自己的知识范围。</div>
<p>建筑师可以是一心一意的，对轻浮、分心或无聊的八卦几乎没有耐心。虽说如此，但他们远非乏味或缺乏幽默感。许多建筑师以其不羁的机智而闻名，在严肃的外表之下，他们通常具有敏锐、令人愉悦的讽刺幽默感。</p>
<h2>社交挫折</h2>
<p>建筑师并不以热情而模棱两可而闻名。他们倾向于把理性和成效放在礼貌和愉快之上--换句话说，他们宁愿是对的，也不愿当老好人。这或许可以解释为什么这么多虚构的反派是仿照这种人格类型打造的。</p>
<p>由于建筑师重视真理和深度，因此许多常见的社交实践--从闲聊到白话--对他们来说似乎毫无意义或是彻头彻尾的愚蠢。结果，当他们只是想实事求是时，他们可能会无意中显得粗鲁甚至令人反感。</p>
<div>有时，建筑师可能会怀疑与他人打交道是否值得为此受挫。</div>
<p>但是，就像任何人格类型一样，建筑师其实渴望社交互动--他们只是更愿意与拥有共同价值观和优先事项的人在一起。通常，他们可以通过做自己来实现这一目标。当建筑师追求他们自己的兴趣时，他们天生的自信可以吸引人们--在职业上、社交上，甚至在恋爱上都是如此。</p>
<h2>人生如棋</h2>
<p>建筑师充满了矛盾。他们富有想象力但果断，雄心勃勃但秘而不宣，好奇但专注。从外部来看，这些矛盾面似乎令人困惑，但是一旦您了解了建筑师思想的内在运作，它们就完全说得通了。</p>
<p>对于这些人格，生活就像一盘棋。建筑师依靠策略而不是几率，在采取行动之前就考虑了每一步的优缺点。他们永远不会失去信心，只要有足够的独创性和洞察力，他们就能找到取胜的方法--无论沿途会出现什么挑战。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/intj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/architect.svg"
        break;
    case "ENTJ":
        name.value="ENTJ 指挥官";
        text.value= `
<p>指挥官是天生的领导者。具有这种个性类型的人体现了魅力和自信的天赋，用某种方式映射权威，将人群聚集在一个共同的目标下。但是，指挥官的特征还通常包括残酷的理性，他们利用自己的动力、决心和敏锐的头脑来实现自己为自己设定的目标。他们只占总人口的3%，这是个好事情，以免他们压倒构成世界其他大部分人口的胆怯和敏感的人格类型--但对于我们现在每天都认为理所当然的很多企业和机构，我们应该感谢指挥官。</p>
<h2>为伟大而奋斗</h2>
<p>如果说指挥官有喜欢的东西，那么挑战绝对算一个，无论大小，他们坚信，只要有足够的时间和资源，他们就可以实现任何目标。这种素质使具有指挥官个性的人成为杰出的企业家，他们在战略思考和长期关注的同时，果断和精确地执行计划的每一步的能力使他们成为强大的商业领袖。这种决心通常是一种自我实现的预言，因为指挥官以纯粹的意志力推动他们的目标，而其他人可能会放弃并继续前进，而他们的外向性(E)本性意味着他们很可能会推动其他所有人与他们一起前进，并在此过程中取得惊人的效果。</p>
<p>在谈判桌上，无论是在公司环境中还是在购买一辆汽车，指挥官都是主导、无情和不宽恕的。这并不是因为他们本身冷漠或恶毒--而是指挥官们真正喜欢挑战、斗智斗勇，以及来自这种环境的回应，如果对方跟不上，指挥官们也没有理由放弃自己最终胜利的核心原则。</p>
<div class="description-pullout">贯穿指挥官头脑的潜在思想可能是 “只要我保持效率，我不在乎你是否称我为麻木不仁”。</div>
<p>如果指挥官尊重某人，那就是能够在智力上与他们站在一起的人，能够以与自己同等的精确度和质量行事的人。指挥官的个性在识别他人的才华方面具有特殊的技能，这有助于他们的团队建设努力 (因为没有人，无论多么出色，都可以独自完成所有事情)，并防止指挥官表现出过多的傲慢和居高临下。但是，他们也具有特殊的技能，可以以令人不寒而栗的麻木不仁来喊出其他人的失败之处，这就是指挥官真正开始遇到麻烦的地方。</p>
<h2>值得进行的挑战</h2>
<p>情感表达并不是任何分析师类型的强项，但是指挥官与情感的距离之大尤其明显，并且被更广泛的人们直接感受到。特别是在专业环境中，指挥官只会粉碎他们认为效率低下、无能或懒惰者的敏感情感。对于指挥官性格类型的人来说，情感表现是软弱的表现，但用这种方法很容易树敌--指挥官需要记住，他们绝对依赖于拥有一个运转良好的团队，不仅是为了实现他们的目标，也是为了他们的认可和反馈，奇怪的是，对于这一点指挥官非常敏感。</p>
<p>指挥官是真正的强者，他们树立了生活中强大的形象--而且经常如此。他们需要记住，他们的地位不仅来自他们自己的行为，还来自支持他们的团队的行为，重要的是要认识到他们的贡献、才能和需求，特别是从情感的角度来看，他们的支持网络。即使他们不得不采取 “装着装着就成真了” 的心态，但如果指挥官能够将情感上健康的关注与他们的许多优势相结合，他们将获得深厚、令人满意的关系和他们能处理的所有挑战的胜利。</p></div> <!----> <!----></article>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/entj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/commander.svg"
        break;
    case "ENTP":
        name.value="ENTP 辩论家";
        text.value= `
        <div class="description__content">
<p>机智而大胆的辩论家不怕说出不同意现状的观点。事实上，他们几乎从不畏惧表达对于任何事情或任何人的不同意。这种个性类型的人热衷于唇枪舌剑--如果对话转向有争议的领域，那就更好了。</p>
<p>但是，将辩论家视为令人讨厌或刻薄的人是错误的。相反，具有这种个性类型的人知识渊博，好奇，具有顽皮的幽默感，并且有令人难以置信的娱乐精神。他们只是对有趣有另类、反常的想法--认为有趣需要涉及热情洋溢的适度辩论。</p>
<div class="description-pullout">辩论家喜欢先假装拥护一种观点而后找出该观点的谬误并粉碎该观点和信念，就像丝带在随风飘荡的过程中为大家所共赌。</div>
<h2>打破规则</h2>
<p>辩论家以叛逆而闻名。对于这种人格类型，没有任何信仰因太神圣而不能被质疑，没有任何想法因太根本而不能被审视，也没有任何规则因太重要而不能被打破，或者至少应经受彻底的考验。有时，辩论家甚至会通过求证相反的观点来对抗自己的信念--只是为了从另一端看看世界的样子。</p>
<p>正如辩论家所看到的那样，大多数人都准备按照要求他们的去做，并且盲目地遵守社会规范、压力和标准。辩论家喜欢质疑主流思维方式的心理锻炼，他们在发现弱者和异常者的价值时会感到愉悦。他们活跃的头脑不禁重新思考其他人认为理所当然的事情，并将他们推向明智的新方向。</p>
<div class="description-pullout">对于许多辩论家来说，生活中最大的挑战之一是将他们广泛的智力能量转化为现实世界的成就和贡献。</div>
<p>虽然辩论家喜欢集思广益和大胆思考，但他们倾向于避免被人看到执行他们的想法的 “艰苦工作”。在某种程度上，这是有道理的--辩论家有太多的想法和建议来追寻，更不用说将它们变成现实了。但是，除非辩论家发展出识别并实际遵循其优先事项的意愿，否则他们可能难以充分利用其潜力。</p>
<h2>逆向主义的代价</h2>
<p>辩论家的辩论能力具有传奇色彩，但这并不意味着它总是会有帮助。当他们在会议上公开质疑老板或将其他重要人物所说的内容时，辩论家可能会认为他们是理性和逻辑的拥护者。但是他们这样做也可能对自己的成功和幸福产生弊大于利的效果。</p>
<p>并非每个场合都需要这种人格类型的默认逆势作为，大多数人忍受他们的信念受到质疑以及不顾他们的感受的时间是有限的。结果，辩论家可能会发现他们喜欢争辩的乐趣常常在不经意间烧毁了许多桥梁。辩论家因其远见、自信、知识和敏锐的幽默感而受到尊重--但除非他们培养一点敏感性，否则他们可能会很难维持更深层次的关系，甚至不能实现自己的职业目标。</p>
<div class="description-pullout">许多辩论家发现，在努力建立牢固的关系时，更富有同情心的方法值得探究。</div>
<p>随着时间的过去，许多辩论家意识到他们的理想生活涉及其他人，而在 “赢得” 争论上花费太多精力最终意味着剥夺自己获得理想生活所需的支持。好消息是，具有这种性格类型的人永远不会失去其明显的不顺从的优势。他们可以轻松地利用自己的认知灵活性来理解和探索他人的观点，认识到多方考虑和妥协的价值，同时考虑逻辑和进展。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/entp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/images/personality-types/scenes/analysts_Debater_ENTP_introduction.svg"
        break;
    case "INFJ":
        name.value="INFJ 提倡者";
        text.value= `
        <div class="description__content">
<p>倡导者可能是最稀有的人格类型，但他们肯定会在世界上留下自己的印记。他们理想主义、有原则，不满足于平平安安地度过一生--他们想要站起来，有所作为。对于倡导者来说，成功不是来自金钱或地位，而是来自寻求成就感，帮助他人，成为世界上一股向善的力量。</p>
<p>他们有远大的目标和抱负，倡导者不应该被误认为是无所事事的梦想家。这种性格类型的人关心的是事情的本真，直到他们做了他们认为正确的事情，才会满足。他们对自己的价值观有着清醒的认识，他们在生活中兢兢业业，他们的目标是永远不会忽视真正重要的东西--不是根据其他人或整个社会，而是根据自己的智慧和直觉。</p>
<h2>寻求目的</h2>
<p>也许是因为他们的性格类型很不常见，倡导者往往会有一种与大多数人不同的感觉--无论他们是否意识到。由于他们丰富的内心生活和寻找生活目标的深沉而持久的渴望，他们并不总是与周围的人融为一体。这并不是说倡导者不能享受社会接纳或亲密关系--只是他们有时会感到被误解或与世界背道而驰。</p>
<p>幸运的是，这种不合拍的感觉并没有削弱倡导者让世界变得更美好的承诺。倡导者受到不公正的困扰，他们通常更关心利他主义而不是个人利益。他们经常觉得有必要利用自己的长处--包括创造力、想象力和敏感度--来鼓舞他人，传播同理心。</p>
<div class="description-pullout">没有什么能像改变别人的生活那样照亮倡导者。</div>
<p>许多倡导者将帮助他人视为生活中的使命，他们一直在寻找介入并为正确的事情大声疾呼的方法。具有这种人格类型的人也渴望解决社会更深层次的问题，希望不公平和艰辛能够成为过去。然而，有时，倡导者可能会如此专注于自己的理想，以至于他们没有充分照顾自己--这种模式可能导致压力和倦怠。</p>
<h2>与他人(和自己)联系</h2>
<p>倡导者可能内向，但他们重视与他人的深厚、真实的关系。很少有事情会像真正认识另一个人一样给这些性格类型带来快乐--同时也为别人所理解。倡导者喜欢有意义的对话远远超过闲聊，他们倾向于以热情和敏感的方式进行交流。这种情感上的诚实和洞察力可以给周围的人留下深刻的印象。</p>
<div class="description-pullout">只要有一些亲密的关系是真实的，就可以使倡导者的内心充满热情。</div>
<p>倡导者深思熟虑并富有同情心，为他们的关系注入了大量的精力和关怀。这并不意味着他们总是会得到回报。倡导者往往以深思熟虑和谨慎的态度行事，当其他人没有意识到他们的良好意图时，这可能会让他们感到沮丧。结果，即使是建设性的批评也可能对这些个性特点的人产生难以置信的伤害。</p>
<h2>个人使命</h2>
<p>许多倡导者认为，他们的生活有一个独特的目标--一个他们来到地球上要完成的使命。对于具有这种个性类型的人来说，生活中最有意义的方面之一就是寻找这个目的--然后，一旦他们找到了这个目的，就努力做到这一点。</p>
<p>当倡导者遇到不公平或不公正时，他们很少放弃--相反，他们会参考自己的直觉和同情心来找到解决方案。  凭借他们与生俱来的平衡心灵和头脑的能力，倡导者天生就能纠正世界上的错误，无论是大是小。这些人只需要记住，当他们忙于照顾其他人的时候，他们需要偶尔停下来，照顾好自己。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/infj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/images/personality-types/scenes/diplomats_Advocate_INFJ_introduction.svg"
        break;
    case "INFP":
        name.value="INFP 调停者";
        text.value= `
        <div class="description__content">
<p>尽管调停者看起来很安静或谦虚，但他们的内心生活充满活力，充满激情。他们富有创造力和想象力，快乐地迷失在白日梦中，在脑海中编造各种故事和对话。这些个性以其敏感性而闻名--调停者可以对音乐，艺术，自然和周围的人产生深刻的情感反应。</p>
<p>理想主义和善解人意，调停者渴望建立深厚而深情的关系，他们觉得有责任帮助他人。但由于这种人格类型只占人口的一小部分，调停者有时可能会感到孤独或被忽视，在一个似乎不欣赏他们独一无二的特质的世界里漂泊。</p>
<h2>移情的天赋</h2>
<p>调停者对人性的深处有着切实的好奇心。从本质上讲，他们对自己的想法和感受非常敏锐，但他们也渴望了解周围的人。调停者富有同情心，不会评判，总是愿意听别人的故事。当有人向他们敞开心扉或向他们寻求安慰时，他们感到很荣幸能够倾听并提供帮助。</p>
<div class="description-pullout">对于调停者来说，在理想的关系中，双方不仅可以分享他们最疯狂的希望和梦想，而且还可以分享他们隐藏的恐惧和弱点。</div>
<p>同理心是这种人格类型最优质的天赋之一，但有时可能是一种负担。世界上的麻烦沉重地压在调停者的肩膀上，这些人格很容易内化他人的消极情绪或心态。除非他们学会设定界限，否则调停者可能会因为需要纠正的错误而感到不知所措。</p>
<h2>说出他们的真相</h2>
<p>没有什么比假装自己不是调停者更令人不安的了。凭借他们的敏感性和对真实性的承诺，具有这种个性类型的人往往渴望创造性的自我表达机会。因此，毫不奇怪，许多著名的调停者是诗人、作家、演员和艺术家。他们不禁沉思人生的意义和目的，梦想着一路上各种各样的故事、想法和可能性。</p>
<div class="description-pullout">调停者有自我表达的天赋。他们可能通过隐喻和虚构人物揭示他们内心的想法和秘密。</div>
<p>通过这些富有想象力的场景，调停者可以探索自己的内在本质以及在世界f上的位置。虽然这是一个美妙的特征，但这些个性有时会表现出白日梦和幻想而不是采取行动的倾向。为了避免感到沮丧、无法实现或无能为力，调停者需要确保他们采取措施将梦想和想法变为现实。</p>
<h2>寻找一种呼唤</h2>
<p>这种性格类型的人往往会感到没有方向或被卡住，直到他们与生活的目标感联系在一起。对于许多调停者来说，这个目的与鼓舞他人有关，也与他们能够感觉到他人的痛苦就像是他们自己的痛苦有关。虽然调停者希望帮助每个人，但他们需要集中精力和努力--否则，他们最终可能会筋疲力尽。</p>
<p>幸运的是，就像春天的花朵一样，即使在最黑暗的季节之后，调停者的创造力和理想主义也能绽放。尽管他们知道世界永远不会完美，但调停者仍然在乎尽其所能使世界变得更好。这种做正确事情的默默信念可能解释了为什么这些人无论走到哪里，总是激发出同情、善良和美丽。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/infp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/mediator.svg"
        break;
    case "ENFJ":   
        name.value="ENFJ 主人公";
        text.value= `
        <div class="description__content">
<p>主人公觉得被召唤为生活中更大的目标服务。这些人格类型深思熟虑，理想化，努力对其他人和他们周围的世界产生积极的影响。他们很少回避做正确事情的机会，即使这样做远非易事。</p>
<p>主人公是天生的领导者，这解释了为什么可以在许多著名的政治家、教练和老师中找到这些个性。他们的热情和魅力使他们不仅可以在自己的职业生涯中，而且可以在生活的各个领域 (包括人际关系) 中激励他人。没有什么比引导朋友和亲人成长为最好的自己更能给主人公带来更深刻的喜悦和满足感了。</p>
<h2>为正确的事情发声</h2>
<p>主人公倾向于大声疾呼自己的价值观，包括实事求是和利他主义。当某些事情使他们感到不公正或错误时，他们会大声说出来。但是他们很少会显得傲慢或急躁，因为他们的敏感性和洞察力会引导他们以与他人共鸣的方式表述。</p>
<p>这些人格类型具有不可思议的能力来了解人们的潜在动机和信念。有时，他们甚至可能自己都不了解如何能如此迅速地掌握了另一个人的思想和内心。这些洞察力的闪光点可以使主人公成为令人难以置信的说客和鼓舞人心的沟通者。</p>
<div class="description-pullout">改变人们的想法并非易事--但如果有人能做到，那就是主人公。</div>
<p>主人公的秘密武器是他们意图的纯粹。一般来说，他们的动机是真诚地希望做正确的事情，而不是想要操纵或拥有对他人的掌控权。即使他们不同意某人，主人公也会求同存异。因此，具有这种性格类型的人可以以几乎无法回绝的口才和敏感性进行交流，尤其是当他们谈论与自己内心深处的事情时。</p>
<h2>参与其中</h2>
<p>当主人公关心某人时，他们希望帮助解决该人的问题--有时不惜一切代价。许多人会感谢主人公的帮助和建议。毕竟，这些人在帮助他人改善生活方面享有盛誉是有原因的。</p>
<div class="description-pullout">主人公是真诚，有爱心的人，他们不仅会说话而且办实事。没有什么比激励其他人去做正确的事情更让他们快乐了。</div>
<p>但是卷入别人的问题并不总是成功的秘诀。主人公往往对人们可以或应该做些什么来改善自己有一个清晰的愿景，但并不是每个人都准备好做出这些改变。如果主人公用力过猛，他们所爱的人可能会感到怨恨或受到了不公正的评判。尽管这种人格类型以洞察力而闻名，但即使是最聪明的主人公有时也可能会误读情况或不知不觉地给出错误的建议。</p>
<h2>引领道路</h2>
<p>具有这种性格类型的人是忠诚的利他主义者，他们随时准备面对吊索和箭头，以捍卫他们所信仰的人和思想。这种信念的力量增强了主人公与生俱来的领导才能，尤其是他们指导人们共同为更高的利益服务的能力。</p>
<p>但他们最大的天赋实际上可能是以身作则。在他们的日常生活中，主人公揭示了如何以同情、奉献和关怀来处理看似普通的情况。对于这些人来说，即使是最小的日常选择和行动--从他们如何度过周末，到他们对苦苦挣扎的同事说的话--都可以成为引领通往更光明未来的机会。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/enfj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/images/personality-types/scenes/diplomats_Protagonist_ENFJ_introduction.svg"
        break;
    case "ENFP":
        name.value="ENFP 竞选者";
        text.value= `
        <div class="description__content">
<p>竞选者享受真正的自由精神--外向、开放和开明。他们以活泼，乐观的生活方式，在任何人群中都能脱颖而出。但是，即使他们的生命中充斥着灯红酒绿，但竞选者并不只是在乎度过美好的时光。这些人格类型有着更深层次的追求--渴望与他人建立有意义的情感联系。</p>
<h2>日常生活的魔力</h2>
<p>友好而外向的竞选者致力于丰富他们的关系和社交生活。但是在他们善于交际，随和的外表之下，他们也拥有丰富而充满活力的内心生活。如果没有相当的想象力、创造力和好奇心，竞选者根本就不会成为竞选者。</p>
<p>以其独特的方式，竞选者可以很内省。他们不禁思考生命的更深层次的含义和意义--即使他们应该关注其他事情。这些人格类型相信一切事物以及每个人都是相互联系的，他们活着就是为了从这些联系中获得的洞察力。</p>
<div class="description-pullout">竞选者是独立和有创造力的，总是在寻找日常生活中的神奇和意义。</div>
<p>当某些事情激发他们的想象力时，竞选者可以表现出一种充满感染力的热情。这些个性散发出积极的能量，吸引了其他人，竞选者可能会发现自己被同龄人作为领导者或大师所支持。但是，一旦最初的灵感绽放消失，竞选者就会在自律和一致性方面挣扎，失去进行对曾经对他们意义重大的项目的动力。</p>
<h2>寻求快乐</h2>
<p>竞选者已经证明，寻找生活的乐趣和快乐并不等同于肤浅。似乎在眨眼之间，具有这种个性类型的人就可以从热情洋溢的理想主义者转变为舞池中无忧无虑的人物。</p>
<div class="description-pullout">竞选者的个性能够强烈地思考和感受--也能够放松心情，玩得开心。</div>
<p>即使在欢乐开怀的时刻，竞选者也希望与他人建立情感联系。对这些人格类型来说，没有什么比与他们珍惜的人进行真诚的交谈更重要的了。竞选者认为，每个人都应该表达自己的感受，他们的同理心和热情创造了一个空间，即使是最胆小的灵魂也可以敞开心扉。</p>
<p>不过，这种性格类型的人需要小心。竞选者的直觉可能会导致他们过多地解读他人的行为和表现。竞选者可能不会简单地要求解释，而是最终会对别人的愿望或意图感到困惑。这种社会压力使注重和谐的竞选者彻夜难眠。</p>
<p>竞选者在找到正确的生活道路之前，将花费大量时间探索不同的关系、感觉和想法。但是，当他们最终找到自己的路时，他们的想象力、同理心和勇气不仅可以照亮自己的生活，还可以照亮周围的世界。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/enfp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/campaigner.svg"
        break;
    case "ISTJ":
        name.value="ISTJ 物流师";
        text.value= `
        <div class="description__content">
<p>物流师以自己的正直为荣。这种性格类型的人说话算数，当他们承诺做某事时，他们一定要坚持到底。</p>
<p>这种人格类型占总人口比较多的一部分，尽管物流师可能不是特别浮华或寻求关注的那一类，但他们所做的远超了自己的分内工作，以使社会保持在坚实、稳定的基础上。在他们的家庭和社区中，物流师经常因其可靠性、实用性以及即使在压力最大的情况下也能保持脚踏实地和逻辑性而赢得尊重。</p>
<div class="description-pullout">在一个许多人推卸责任或专说他们认为别人想听的话的世界中，物流师以奉献、负责和诚实的态度脱颖而出。</div>
<h2>正直的生活</h2>
<p>物流师自尊的核心来自个人诚信意识。具有这种性格类型的人认为，在任何情况下都有正确的方法行事--任何假装这样行不通的人都可能试图改变规则以适应自己的目的。物流师非常尊重结构和传统，他们经常被提供清晰等级和期望的组织、工作场所和教育环境所吸引。</p>
<div class="description-pullout">对于许多物流师来说，缺乏结构不是自由，而是混乱。</div>
<p>具有物流师性格类型的人很少在为自己的行为和选择承担责任方面犹豫不决。一般来说，他们很快就会承认自己的错误并认清事实，即使事实并不能使他们很光彩。对于物流师来说，诚实远比表演技巧重要，他们宁愿凭自己的良心平淡无奇，也不愿用撒谎来打动别人。</p>
<p>因为无论如何他们都努力履行自己的义务，所以物流师的性格常常为那些未能达到相同标准的人所不解。有时，物流师可能会不公平地误判那些无法达到严格意义上自我控制的人--怀疑这些人懒惰或不诚实，实际上他们可能正在应对其他挑战。即使物流师不大声说出这些判断，他们的不屑也会随之而来，从而为他们赢得了严苛或不具有同情心的声誉。</p>
<h2>收拾烂摊子</h2>
<p>物流师的奉献精神是令人钦佩的品质，这推动了他们取得许多成就。但这也可能成为其他人利用的弱点。物流师以其强烈的职业道德和责任感，可能会经常发现自己承担着他人的责任。即使他们不抱怨这种情况，如果物流师经常被期望(或自己承担责任)为同事、朋友或亲人收拾残局，他们最终可能会精疲力尽或心灰意冷。</p>
<div class="description-pullout">物流师可能会发现自己在做别人的工作--却没有为此获得功劳。</div>
<p>物流师并不善于表达自己的情绪，但这并不意味着这种性格类型的人在承受超过额定负荷时不会感到沮丧或怨恨。除非他们确保他们的关系是平衡和可持续的，否则物流师最终可能会损害他们认为需要保护的非常稳定的状态。好消息是，通过学习设定适当的界限并在过度紧张时大声疾呼，物流师可以为世界提供他们许多天赋的全部利好，包括他们的清晰度、忠诚度和可靠性。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/istj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/images/personality-types/scenes/sentinels_Logistician_ISTJ_introduction.svg"
        break;
    case "ISFJ":
        name.value="ISFJ 守卫者";
        text.value= `
        <div class="description__content">
<p>守卫者以谦逊，低调的方式帮助世界发展。这种性格类型的人勤奋敬业，对周围的人深感责任感。可以指望守卫者在截止日期前完成任务，记住生日和特殊场合，坚持传统，并为他们的亲人送去关怀和支持。但是他们很少要求认可他们所做的一切，而是更喜欢在幕后默默奉献。</p>
<p>这是一种能干、肯干的个性类型，并且多才多艺。尽管守卫者敏感且充满爱心，但他们也具有出色的分析能力和对细节的关注。尽管他们比较矜持，但他们往往具有很强的人际交往能力和牢固的社会关系。守卫者确实不仅仅是他们各个部分的总和，他们的各种力量甚至在日常生活中最普通的方面也闪耀着光芒。</p>
<div class="description-pullout">守卫者是真正的利他主义者，他们会以更大的善意来对待友善，并以热情和慷慨的态度参与他们的工作和对待他们相信的人们。</div>
<h2>忠诚</h2>
<p>守卫者最独特的特征是忠诚。守卫者从不会因缺乏努力而让友谊或关系消失。相反，他们投入了大量精力与亲人保持牢固的联系--而不仅仅是发送 “您怎么样？”的短信。这种性格类型的人以在朋友或家人遇到困难时放下一切并伸出援手而闻名。</p>
<div class="description-pullout">当守卫者出现在需要帮助的人面前时，他们往往会感到精力充沛和很有效率。</div>
<p>守卫者的忠诚感并不止于他们最亲近和最爱的人--它通常延伸到他们的社区、他们的雇主，甚至是家庭传统。但是他们的承诺和强烈的服务愿望可能有其缺点。其他人可能会利用守卫者的乐于助人，勤奋的天性，使他们感到精疲力尽和过度劳累。当守卫者考虑改变自己、他们的关系或过去的做事方式时，他们可能会感到内疚或压力。</p>
<h2>最高标准</h2>
<p>对于守卫者来说，“足够好” 很少能满足他们。这种性格类型的人要一丝不苟地做到完美主义。他们亲自承担自己的责任，不断超越并竭尽所能，超越他人的期望。</p>
<div class="description-pullout">守卫者个性以谦逊著称，他们很少寻求活在聚光灯下。</div>
<p>但是，当守卫者的努力不被注意或不被赞赏时会发生什么？尽管守卫者倾向于低估自己的成就，但这并不意味着他们不在乎认可--或者他们甘愿被视为理所当然。除非他们学会为自己振作起来，否则守卫者可能会发现自己悄悄地失去了热情和动力，最终对那些似乎不欣赏他们的人感到不满。</p>
<h2>为他人和自己露面</h2>
<p>尽管他们内向，但守卫者具有深厚的社交本能。由于他们能够记住他人生活的细节，守卫者具有特殊的才能，可以使他们的朋友和熟人感到被人关注和珍惜。很少有人格类型能与守卫者在任何场合 (无论大小) 选择合适礼物的能力相提并论。</p>
<p>敬业而周到的守卫者在帮助周围的人建立稳定、安全和幸福的生活中找到了极大的乐趣。对于这种性格类型的人来说，以为他人展示的方式来表现自己可能并不容易，但是当他们这样做时，他们往往会发现自己有更多的精力和动力在世界上做善事。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/isfj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/defender.svg"
        break;
    case "ESFJ":
        name.value="ESFJ 执政官";
        text.value= `
        <div class="description__content">
<p>对于执政官来说，与他人分享生活是最甜蜜的。具有这种人格类型的人构成了许多社区的基石，向朋友、亲人和邻居开放了他们的家园和心灵。</p>
<p>这并不意味着执政官像每个人一样，又或者他们是圣人。但是执政官确实相信好客和礼貌的力量，他们往往会对周围的人感到一种责任感。慷慨而可靠，这种性格类型的人经常以大大小小的方式承担自己的责任，将家人和社区团结在一起。</p>
<div class="description-pullout">执政官具有使生活中的人们感到被支持、被照顾和安全的才能。</div>
<h2>负责任的生活之美</h2>
<p>执政官是利他主义者。他们认真对待自己的责任，回馈他人，服务他人，做正确的事。</p>
<p>执政官们认为，在几乎每种情况下，都有明确的正确做法。一些性格类型的人采取更宽容、和睦相处的态度，但执政官可能会发现，当某人选择了一条让他们感到误入歧途的道路时，他们很难不做出评判。结果就是，当某人(尤其是他们关心的人)不同意他们的观点时，执政官常常难以接受。</p>
<div class="description-pullout">执政官有一个明确的道德指南针--当其他人的行为与之不符时，会令他们感到困惑。</div>
<p>执政官对是非有明确的看法，往往倾向于固执己见。但是这些观点并不是任意的--它们通常是基于对传统的深刻尊重。执政官知道他们所做的一切都会影响别人，他们相信既定的法律、协议和社会规范将帮助他们以体恤和对他人负责的方式驾驭日常生活。</p>
<h2>建立持久的关系</h2>
<p>总是可以在聚会上看到乐于助人和外向的执政官--他们是四处走动的人，以确保其他所有人都玩得开心! 但不要搞错: 执政官不会随便闯入别人的生活。他们忠于核心，建立了持久的关系，每当需要伸出援助之手或侧耳倾听，就可以指望他们出现。</p>
<div class="description-pullout">执政官很少错过生日或假期。他们专注于自己的人际关系，即使是朋友和亲人生活中的最小细节也会被铭记。</div>
<p>由于对秩序和结构的热爱，执政官更喜欢有计划的活动，而不是开放式活动或自发的聚会--他们很乐意主办这种活动，以确保一切顺利进行。这种性格的人会投入大量精力让别人觉得自己很特别，很受欢迎，当有人似乎不欣赏他们的努力时，他们可能会放在心上。</p>
<p>对于许多具有执政官人格类型的人来说，生活中最大的挑战之一就是接受他们无法控制其他人的思想或行为--甚至无法控制与他们最亲近的人。幸运的是，执政官可以通过专注于他们最擅长的事情来找到和平与充实: 树立关怀、体恤和负责任的榜样--并在此过程中使人们团结在一起。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/esfj-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/consul.svg"
        break;
    case "ISTP":
        name.value="ISTP 鉴赏家";
        text.value= `
        <div class="description__content">
<p>鉴赏家喜欢用他们的手和眼睛探索，用冷静的理性主义和热情的好奇心触摸和审视他们周围的世界。具有这种个性类型的人是天生的创造者，他们从一个项目转移到另一个项目，从乐趣出发构建有用的事物和冗余，并在他们前进的过程中向他们的环境学习。通常作为机械师和工程师，鉴赏家们发现没有什么比亲自上手把东西拆开并重新组装更快乐的了，而这只是为了比之前好一丢丢。</p>
<p>鉴赏家通过创建、故障排除、反复试验和第一手经验探索想法。他们乐于让其他人对他们的项目感兴趣，有时甚至不介意他们进入自己的空间。当然，这是在这些人不干涉鉴赏家的原则和自由的条件下，并且他们需要对鉴赏家反馈的相似兴趣持开放态度。</p>
<p>鉴赏家喜欢伸出援手并分享他们的经验，尤其是与他们关心的人分享，只可惜他们如此稀少，仅占总人口的5%。鉴赏家在女性中尤其罕见，社会倾向于期望的典型性别角色可能不适合她们--她们从小就被视为假小子。</p>
<h2>敢于与众不同</h2>
<p>虽然他们机械式想上手的倾向可以使他们一目了然，但鉴赏家实际上还是相当神秘的。友好但非常隐秘，冷静但又会突然心血来潮，非常好奇但无法专注于正规学习，即使是他们的朋友和亲人，对鉴赏家个性的人进行预测也可能是一项挑战。一段时间以来，鉴赏家似乎非常忠诚和稳定，但他们倾向于建立一种蓄势的能量储存，这种能量会在没有任何警告的情况下爆发，将他们的兴趣推向大胆的新方向。</p>
<div class="description-pullout">然而，当鉴赏家做出这些翻天覆地的变化时，他们只是在探索一种新兴趣的可行性，而不是某种愿景探索。</div>
<p>鉴赏家的决定源于一种实用的现实主义感，他们的内心是一种强烈的普世的直接公平感，一种 “己所不欲勿施于人” 的态度，这确实有助于解释鉴赏家的许多令人费解的特征。不过，鉴赏家可能不会过分谨慎，瞻前顾后，而是会走得很远，以对等的方式对善意或恶意进行回应。</p>
<p>鉴赏家可能面临的最大问题是，他们经常行动得太早，把他们放纵的天性认为理所当然，并假设其他人也是一样的。他们将是第一个讲一个麻木不仁的笑话，过度参与别人的项目，粗鲁地玩耍，或者因为更有趣的事情出现而突然改变他们的计划的人。</p>
<h2>违抗规则</h2>
<p>鉴赏家将会逐渐了解到，许多其他性格类型的人在规则和可接受的行为上比他们更为严格--他们不想听到一个麻木不仁的笑话，当然也不会在背后议论别人，他们也不想参与恶作剧，即使有人愿意这样做。如果现场已经情绪化，那么无视这些限制可能会事与愿违。</p>
<p>鉴赏家在预测情绪方面有特别的困难，但这只是他们公平性的自然延伸，因为要衡量鉴赏家的情绪和动机是非常困难的。然而，他们倾向于通过行动而不是通过同理心来探索他们的关系，这可能会导致一些非常令人沮丧的情况。具有鉴赏家性格类型的人在边界和准则上挣扎，他们更喜欢自由走动，并在他们需要时打破规则。</p>
<p>找到一个可以与了解自己风格和不可预测性的好朋友一起工作的环境，结合他们的创造力、幽默感和动手方法来构建实用的解决方案和事物，将使鉴赏家在构建有用的实物方面拥有许多快乐的时光--并能从局外欣赏它们。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/istp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/virtuoso.svg"
        break;
    case "ISFP":
        name.value="ISFP 探险家";
        text.value= `
        <div class="description__content">
<p>探险家是真正的艺术家 -- 尽管不一定是传统意义上的。对于这种人格类型，生活本身就是自我表达的画布。从他们的穿着到他们如何度过空闲时间，探险家的行为方式生动地反映了他们作为独特个体的身份。</p>
<p>每个探险家当然都是独一无二的。出于好奇心和尝试新事物的渴望，具有这种性格的人往往拥有一系列令人着迷的激情和兴趣。凭借他们的探索精神和在日常生活中找到快乐的能力，探险家可以成为您见过的最有趣的人之一。唯一的讽刺？不张扬、谦逊的探险家往往认为自己“只是在做自己的事情”，因此他们甚至可能没有意识到自己有多了不起。</p>
<h2>敞开心胸的美</h2>
<p>探险家拥抱灵活、适应性强的生活方式。一些性格类型的人喜欢严格的时间表和常规，但探险家却不是。探险家每天都在努力，做当下对他们来说正确的事情。他们确保在生活中留出足够的空间来应对意想不到的事情，因此，他们最珍惜的许多记忆都是自发的、一时冲动的郊游和冒险，包括独自和与亲人一起进行。</p>
<p>这种灵活的思维方式使探险家表现出极大的宽容和开放。这些人真的喜欢生活在一个充满各种各样的人的世界里，即使是不同意他们的观点或选择截然不同的生活方式的人。因此，探险家对改变主意和重新思考自己的观点持不同寻常的态度也就不足为奇了。如果某个性格类型相信给某事 (或某人) 第二次机会，那就是探险家。</p>
<div class="description-pullout">探险家希望生活在一个世界上，在这个世界上，他们--以及其他所有人--都可以自由地生活，而不需要被评判。</div>
<p>虽然这样说，但探险家的顺其自然的心态可能有其缺点。具有这种性格类型的人可能很难制定长期计划--更不用说坚持了。因此，探险家往往对自己实现目标的能力有相当模糊的看法，他们经常担心让其他人失望。探险家可能会发现，在他们的生活中增加一点框架结构有助于帮助他们感到更有能力和有条理--同时不会压制他们的独立精神。</p>
<h2>和谐相处</h2>
<p>在他们的人际关系中，探险家热情、友好、有爱心，全心全意地享受他们最亲近的人的陪伴。但请不要误会: 这是一种内向的性格类型，这意味着探险家在与他人交往后需要独处的时间来充实自己的精力。这一单独的时间让探险家重新建立了自己的身份感--换言之，重新认识自己的真实身份。</p>
<div class="description-pullout">除非他们为自己留出时间，否则探险家最终可能会在日常生活的浪潮中感到迷失，不断地对外部环境做出反应，而不是走自己的路。</div>
<p>富有创造力和自由精神的探险家们按照自己的节奏前进，人们很容易认为他们并不特别担心别人对他们的看法。但事实并非如此--探险家深思熟虑、洞察力强，能够捕捉到人们未说出口的感受和意见，如果他们觉得自己不被喜欢、认可或欣赏，这可能会让他们感到不安。当面对批评时，对于这种性格类型的人来说，要不陷入一时的愤怒之中可能是一个挑战。如果他们遇到严厉或看似不公平的批评，他们甚至可能以惊人的方式发脾气。</p>
<p>但是也有好的一面: 探险家生活在当下，他们知道他们不需要纠结于过去的伤痛或挫折。这种性格类型的人不关注事情会有什么不同，而是有一种不可思议的能力去欣赏生活中正确的一面。无论在哪里，探险家都能找到其他人可能会错过的美丽和享受的源泉——而这种视角只是他们与世界分享的众多礼物之一。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/isfp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/adventurer.svg"
        break;
    case "ESFP":
        name.value="ESFP 表演者";
        text.value= `
        <div class="description__content">
<p>如果有人自发地闯入歌舞，那就是表演者性格类型的人。表演者会陷入当下的兴奋之中，并希望其他人也有这种感觉。在鼓励他人时，其他人格类型不会像表演者那样慷慨地投入时间和精力，同时其他人格类型也不能以这种不可抗拒的风格做到这一点。</p>
<h2>充满激情地生活</h2>
<p>表演者喜欢聚光灯，全世界都是舞台。许多具有表演者性格类型的名人确实是演员，但他们也喜欢为朋友表演，以独特而质朴的机智聊天，吸引注意力，使每次出行都有点像聚会。完全融入社交，表演者享受最简单的事情，对他们来说，没有比和一群好朋友一起玩乐更大的快乐了。</p>
<p>不仅限于交谈--表演者具有任何人格类型中最强的审美意识。从美容和服装到布置考究的家，表演者对时尚充满关注。看到的即刻就能了解什么有吸引力，表演者不怕改变周围的环境来反映他们的个人风格。表演者天生好奇，可以轻松探索新的设计和风格。</p>
<p>尽管看起来并不总是如此，但表演者知道他们自己不是一切的中心--他们善于观察，并且对他人的情绪非常敏感。具有这种性格类型的人通常是第一个帮助别人说出具有挑战性的问题、愉快地提供情感支持和实用建议的人。但如果问题是他们自身的，表演者更会完全避免冲突，而不是正面解决冲突。表演者通常喜欢一点戏剧性和激情，但当他们因为这些可能成为批评的焦点时，他们就不会这么做了。</p>
<h2>心血来潮的精神世界</h2>
<p>表演者面临的最大挑战是，他们往往过于专注于眼前的快乐，以至于忽略了承载这些快乐的职责和责任。对于表演者来说，复杂的分析，重复的任务以及将统计数据与实际结果相匹配并非易事。他们宁愿依靠运气或几率，或者干脆向他们广泛的朋友圈寻求帮助。对于表演者来说，挑战自己以跟踪长期的事务(例如退休计划或糖的摄入量)很重要--周围不会总是有其他人可以帮助关注这些事情。</p>
<p>表演者能识别价值和质量，这本身是一个很好的特征。但是他们倾向于没有一套好的规划，这可能会导致他们入不敷出，信用卡尤其堪忧。与计划长期目标相比，表演者更专注于抓住机会，他们可能会发现他们的注意力不集中可能使某些活动效果大打折扣。</p>
<div class="description-pullout">如果表演者意识到他们被环境所束缚，无法加入他们的朋友，这会让他们非常沮丧。</div>
<p>无论在哪里，只要需要欢笑、娱乐和尝试新鲜有趣事物的志愿者，都会欢迎表演者，没有什么比带其他人一起去兜风开怀更大的乐趣了。表演者可以一次聊几个小时，有时谈论的所有内容跟他们原准备谈论的内容毫不相干，并且无论在顺境还是逆境，他们都能感受到爱人的情感。如果他们能对即将发生的事情做好准备，他们将可以随时准备好和身后的朋友们探索世界上所有新的令人兴奋的事物。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/esfp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/entertainer.svg"
        break;
    case "ESTP":
        name.value="ESTP 企业家";
        text.value= `
        <div class="description__content">
<p>企业家总是对他们周围的环境产生影响--在聚会上发现他们的最好方法是寻找由于他们在人群之间移动时形成人流的漩涡。欢声笑语、娱乐性十足的企业家以一种质朴的幽默，喜欢成为众人关注的焦点。如果要求听众上台，企业家会自愿参加--或者自愿给一个害羞的朋友当志愿者。</p>
<p>关于全球问题及其影响的理论、抽象概念和令人费解的讨论不会让企业家长时间感兴趣。企业家们保持他们的谈话充满活力、充满智慧，但他们喜欢谈论是什么的问题--或者更进一步，出去做这件事。企业家在他们看到之前就跃跃欲试，边走边修正自己的错误，而不是闲着，准备突发事件和应急规避条款。</p>
<h2>立即投入</h2>
<p>企业家是最有可能是以冒险行动为主导的生活方式的人格类型。他们活在当下，并会立即投入--他们是风暴的焦点。企业家性格类型的人喜欢复杂的剧情、激情和快乐，不是因为情感上的兴奋，而是因为这会让他们的逻辑思维兴趣盎然。在快速的理性刺激反应过程中，他们被迫根据事实、直接的现实做出关键决定。</p>
<p>这使得学校和其他高度组织化的环境对企业家来说是一个挑战。当然不是因为他们不聪明，他们可以做得很好，但是正规教育的有条理的讲课方法离企业家喜欢的动手学习相距甚远。要将此过程视为实现目标的必要手段，需要很高的成熟度，这会创造更多令人兴奋的机会。</p>
<p>同样具有挑战性的是，对于企业家来说，使用自己的道德指南针比其他人的道德指南针更有意义。规则本来就是要被打破的。很少有高中教师或公司主管会认同这种观点，并且这些观点可能让人们对企业家人士产生一些看法。但是，如果他们最大程度地减少制造麻烦，利用自己的精力并专注于事物本身，那么企业家就是一支不可忽视的力量。</p>
<h2>少走弯路</h2>
<p>也许是最敏锐、最不过滤视角的性格类型，企业家在注意到微小变化方面具有独特的技能。从面部表情的转变，新的服装风格，或旧有习惯的打破，这种性格类型的人都会察觉到隐藏的思想和动机，而大多数类型的人都很难察觉任何特定的东西。企业家会立即使用这些观察结果，大声疾呼改革并提出问题，通常很少考虑敏感性。企业家应该记住，并不是每个人都希望自己的秘密和决定得到传播。</p>
<div class="description-pullout">有时，企业家的即时观察和行动正是所需要的，例如在某些公司环境中，尤其是在紧急情况下。</div>
<p>但是，如果企业家不小心，他们可能会陷入困境，走得太远，对更敏感的人粗暴对待，或者忘记照顾自己的健康和安全。企业家仅占人口的4%，对于保持敏锐和高度的竞争力已足够，同时不会造成系统性风险。</p>
<p>企业家充满激情和活力，辅之以理性的，有时是千头万绪的头脑。鼓舞人心，令人信服，丰富多彩，他们是天生的团体领袖，一路上引导每个人少走弯路，无论走到哪里都带来生机和兴奋。将这些品质用于建设性和有益的目的是企业家真正的挑战。</p></div>
        <br><br> <a class="ambti"  href="https://www.16personalities.com/ch/estp-%E4%BA%BA%E6%A0%BC">来源于 16Personalities</a>`;
        img.value="https://www.16personalities.com/static/animations/type-descriptions/introductions/entrepreneur.svg"
        break;
    }
   display.value='on'
   }
</script>

<style>
.pp{
    width:80px;
    margin-bottom: 20px;
    font-size:1em
}
.off{
    visibility: hidden;
}
.description__content{
    margin: 0 0 20px 0;
}
.on{
       visibility: visible;
    }
.mmm{
    margin: 30px;
}
.ambti{
    color:#2a598a
}
.search{
    margin:20px
}
</style>